cmsis-svd/cmsis-svd/data/SiliconLabs/EFM32GG280F1024.svd
        <register>
          <name>ETMPIDR2</name>
          <description>Peripheral ID2 Register</description>
          <addressOffset>0xFE8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0000003B</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>IDCODE</name>
              <description>JEP106 Identity Code</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ALWAYS1</name>
              <description>Always 1</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REV</name>
              <description>Revision</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETMPIDR3</name>
          <description>Peripheral ID3 Register</description>
          <addressOffset>0xFEC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>CUSTMOD</name>
              <description>Customer Modified</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REVAND</name>
              <description>RevAnd</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETMCIDR0</name>
          <description>Component ID0 Register</description>
          <addressOffset>0xFF0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0000000D</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>PREAMB</name>
              <description>CoreSight Preamble</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETMCIDR1</name>
          <description>Component ID1 Register</description>
          <addressOffset>0xFF4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000090</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>PREAMB</name>
              <description>CoreSight Preamble</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETMCIDR2</name>
          <description>Component ID2 Register</description>
          <addressOffset>0xFF8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000005</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>PREAMB</name>
              <description>CoreSight Preamble</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ETMCIDR3</name>
          <description>Component ID3 Register</description>
          <addressOffset>0xFFC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x000000B1</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>PREAMB</name>
              <description>CoreSight Preamble</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
  </peripherals>
<!-- vendorExtions is _reqiuired_ to pass through Schema validation -->
  <vendorExtensions>
    <name>Copyright 2018 Silicon Laboratories, Inc.</name>
    <flashBaseAddress>0x00000000</flashBaseAddress>
    <flashSize>0x00100000</flashSize>
    <flashAccessTypes>rx</flashAccessTypes>
    <sramBaseAddress>0x20000000</sramBaseAddress>
    <sramSize>0x00020000</sramSize>
    <sramAccessTypes>rwx</sramAccessTypes>
  </vendorExtensions>
</device>
